
path_platform_1c = ""  # путь к платформе 1с например C:\Program Files\1cv8\8.3.17.1549\bin\1cv8.exe
path_filebase_1c = ""  # путь к базе, конфигуратор которой откроется
dirforfiles_1c = ""  # путь к каталогу с внешними обработками
dirforxmlfiles_from1c = ""  # путь к каталогу куда выгрузить внешние обработки

address_server_1c = ""  # Сервер 1с localhost:2640
name_infobase_1c = ""  # Имя информационной базы

username_1c = ""  # Пользователь 1с
secret_1c = ""  # пароль 1с

host = r'127.0.0.1'  # адрес, где запустится конфигуратор как агент. К нему будет подключение по SSH для послания команд
user = r''  # логин для подключения по SSH
secret = r''  # пароль для подключения по SSH
port = 1543  # порт для подключения по SSH